[
  {
    "slug": "airbnb-weirdly-specific",
    "title": "Weirdly Specific TikTok Series",
    "client": "Airbnb",
    "tag": "TikTok Strategy",
    "summary": "Creative strategy connecting TikTok's unique subcommunities to Stays that represent them, creating 'Weirdly Specific' lists that paired unique Airbnbs with equally unique TikTok communities.",
    "image": "/campaigns/airbnb.png",
    "header": {
      "bg": "gray-50",
      "darkBg": "gray-900"
    },
    "main": {
      "sections": [
        {
          "heading": "The Challenge",
          "content": [
            "Airbnb wanted to shift from generic travel content and reach a broader audience on TikTok. The goal: connect the unique communities on TikTok to the Stays that represent them."
          ]
        },
        {
          "heading": "Strategic Solution",
          "content": [
            "We created a creative strategy that let us speak authentically to all of TikTok's subcommunities, from TravelTok to BookTok to CelebrityTok and beyond.",
            "To break through on TikTok's For You Page didn't mean diluting your message to a one-size fits all. Instead, the more niche you got, the more chances you had at winning attention. So we made a video series of Weirdly Specific lists that paired unique Airbnbs with equally unique TikTok communities. This let Airbnb continue to speak to their loyal travel audiences, while also showing untapped audiences how they could use Airbnb in their own authentic way."
          ]
        },
        {
          "heading": "Campaign Execution",
          "content": [
            "Strategy/ Leadership",
            "Team Quarterback",
            "Testing Roadmap Development + Analysis"
          ]
        }
      ],
      "sidebar": {
        "role": [
          "Strategy/ Leadership",
          "Team Quarterback",
          "Testing Roadmap Development + Analysis"
        ],
        "results": [
          { "label": "Results", "value": "Project did not get full runway due to internal org shifts, but creative work was strong." }
        ]
      }
    },
    "nextProject": {
      "slug": "beats-authentic-tiktok",
      "client": "Beats by Dre",
      "title": "Authentic TikTok Content Series"
    }
  },
  {
    "slug": "beats-authentic-tiktok",
    "title": "Authentic TikTok Content Series",
    "client": "Beats by Dre",
    "tag": "Content Strategy",
    "summary": "Defied norms on TikTok by embracing the inherent awkwardness of sponsored content, making it obvious and highly entertaining through self-awareness and subversion.",
    "image": "/campaigns/beats.png",
    "header": {
      "bg": "gray-50",
      "darkBg": "gray-900"
    },
    "main": {
      "sections": [
        {
          "heading": "The Challenge",
          "content": [
            "True to our ethos of defiance, we recognized TikTok demanded a radically different approach. Instead of chasing a manufactured 'authenticity,' we chose to be unapologetically real."
          ]
        },
        {
          "heading": "Strategic Solution",
          "content": [
            "Our strategy embraced the inherent awkwardness of sponsored content, making it obvious – and highly entertaining. We leveraged self-awareness and subversion, directly speaking to the platform's native behavior. This unconventional content series didn't just cut through the noise; it earned a Webby and a Silver Pencil at The One Show, proving that realness triumphs."
          ]
        }
      ],
      "sidebar": {
        "role": [
          "Strategy/ Leadership",
          "Analysis & Reporting"
        ],
        "results": [
          { "label": "Webby Award", "value": "Winner" },
          { "label": "Silver Pencil at The One Show", "value": "Winner" }
        ]
      }
    },
    "nextProject": {
      "slug": "cashapp-financial-freedom",
      "client": "Cash App",
      "title": "Cash App: Redefining Financial Freedom for Gen-Z"
    }
  },
  {
    "slug": "cashapp-financial-freedom",
    "title": "Cash App: Redefining Financial Freedom for Gen-Z",
    "client": "Cash App",
    "tag": "Growth Marketing",
    "summary": "Strategic repositioning from peer-to-peer payments to comprehensive banking solution, achieving 19% lower CPA and establishing Cash App as the go-to financial platform for young adults.",
    "image": "/campaigns/cashapp.png",
    "header": {
      "bg": "gray-50",
      "darkBg": "gray-900"
    },
    "main": {
      "sections": [
        {
          "heading": "The Challenge",
          "content": [
            "Cash App was primarily perceived as a peer-to-peer payment app, limiting its growth potential among Gen-Z users who were seeking comprehensive financial solutions. The challenge was to reposition Cash App as a full-service banking platform while maintaining its core brand identity and user trust.",
            "Traditional banking messaging wasn't resonating with our target demographic, who valued authenticity, simplicity, and financial empowerment over traditional banking benefits."
          ]
        },
        {
          "heading": "Strategic Solution",
          "content": [
            "We developed the 'Financial Freedom' campaign that positioned Cash App not just as a payment tool, but as a gateway to financial independence for young adults. The strategy focused on three key pillars:",
            "Empowerment Messaging: Shifted from features to outcomes, emphasizing how Cash App enables financial goals",
            "Cultural Relevance: Integrated trending topics, memes, and Gen-Z language patterns",
            "Social Proof: Leveraged user-generated content and micro-influencer partnerships"
          ]
        },
        {
          "heading": "Campaign Execution",
          "content": [
            "Developed a systematic approach to testing creative, messaging, and targeting across 4 growth marketing cycles, with each cycle surpassing previous performance records.",
            "Created attention-grabbing creative that spoke directly to Gen-Z's financial aspirations, using platform-native formats and unexpected messaging to drive engagement and conversions.",
            "Optimized performance across Meta and TikTok platforms, adapting creative and messaging for each platform's unique audience behaviors and conversion patterns."
          ]
        }
      ],
      "sidebar": {
        "role": [
          "Led 8+ person team across 4 growth marketing cycles",
          "Social-first creative strategy",
          "Performance optimization",
          "Gen-Z positioning strategy"
        ],
        "results": [
          { "label": "Lower CPA on Meta", "value": "-19%" },
          { "label": "Lower CPA on TikTok", "value": "-15%" },
          { "label": "Each surpassed previous records", "value": "4 Cycles" }
        ]
      }
    },
    "nextProject": {
      "slug": "fiat-la-dolce-vita",
      "client": "Fiat",
      "title": "La Dolce Vita Launch Campaign"
    }
  },
  {
    "slug": "fiat-la-dolce-vita",
    "title": "La Dolce Vita Launch Campaign",
    "client": "Fiat",
    "tag": "Launch Campaign",
    "summary": "360-degree launch campaign for the all-electric Fiat 500e, translating 125+ years of European heritage into compelling American narrative by positioning 'Italian-ness' as a universal way of appreciating life's finer details.",
    "image": "/campaigns/fiat.png",
    "header": {
      "bg": "gray-50",
      "darkBg": "gray-900"
    },
    "main": {
      "sections": [
        {
          "heading": "The Challenge",
          "content": [
            "Founded in 1899, Fiat boasted over 125 years of profound brand recognition in Europe. Yet, in the U.S., it remained a niche Italian brand struggling for broad relevance. The challenge for the 2024 launch of the all-electric Fiat 500e: how to translate deep European heritage into a compelling American narrative.",
            "The strategy transcended geography, boiling 'Italian-ness' down to a universal way of living: appreciating life's finer details – beauty, passion, color, and style. The new Fiat 500e perfectly embodies these values, making La Dolce Vita accessible to anyone, anywhere."
          ]
        },
        {
          "heading": "Campaign Execution",
          "content": [
            "I led the strategic development and comprehensive orchestration of this 360-degree launch campaign, collaborating seamlessly with media, PR, and the in-house Fiat brand, sales, and product teams to ensure flawless go-to-market execution across every touchpoint."
          ]
        }
      ],
      "sidebar": {
        "role": [
          "Strategic Development & Orchestration",
          "Cross-functional Team Leadership",
          "Go-to-Market Execution"
        ],
        "results": [
          { "label": "Conversions to Website", "value": "2.5M" },
          { "label": "Above Social Benchmarks", "value": "+1,791%" },
          { "label": "Impressions", "value": "700M" },
          { "label": "Views", "value": "270M" }
        ]
      }
    },
    "nextProject": {
      "slug": "gin-juice-launch",
      "client": "Gin & Juice",
      "title": "Gin & Juice Launch"
    }
  },
  {
    "slug": "gin-juice-launch",
    "title": "Gin & Juice Launch",
    "client": "Gin & Juice",
    "tag": "Brand Launch",
    "summary": "Strategic launch campaign for Snoop Dogg's premium beverage brand, focusing on cultural authenticity and market positioning to establish credibility in the premium spirits space.",
    "image": "/campaigns/gin-juice.png",
    "header": {
      "bg": "gray-50",
      "darkBg": "gray-900"
    },
    "main": {
      "sections": [
        {
          "heading": "The Challenge",
          "content": [
            "Establishing Snoop Dogg's Gin & Juice as a credible, premium beverage brand in a crowded spirits market required a launch that balanced cultural authenticity with aspirational positioning."
          ]
        },
        {
          "heading": "Strategic Solution",
          "content": [
            "Focused on Snoop Dogg's cultural cachet and storytelling, we crafted a campaign that celebrated both the brand's roots and its premium quality, ensuring it resonated with both core fans and new audiences."
          ]
        },
        {
          "heading": "Campaign Execution",
          "content": [
            "Brand Launch Strategy",
            "Cultural Positioning",
            "Market Rollout"
          ]
        }
      ],
      "sidebar": {
        "role": [
          "Strategy/ Leadership",
          "Brand Launch Strategy",
          "Cultural Positioning"
        ],
        "results": [
          { "label": "Brand Established in Premium Spirits Market", "value": "Yes" }
        ]
      }
    },
    "nextProject": {
      "slug": "hellmanns-make-taste-not-waste",
      "client": "Hellmann's",
      "title": "Make Taste, Not Waste"
    }
  },
  {
    "slug": "hellmanns-make-taste-not-waste",
    "title": "Make Taste, Not Waste",
    "client": "Hellmann's",
    "tag": "Super Bowl",
    "summary": "Transformed Hellmann's from just a condiment to essential ingredient that helps turn food waste into delicious meals, targeting Millennials' hate of food waste and 'Fridge Blindness'.",
    "image": "/campaigns/hellmanns.png",
    "header": {
      "bg": "gray-50",
      "darkBg": "gray-900"
    },
    "main": {
      "sections": [
        {
          "heading": "The Challenge",
          "content": [
            "Hellmann's faced declining sales and lost share, particularly with Millennials who saw it as just a condiment. We pinpointed a new, impactful purpose: one that expanded usage occasions while delivering genuine social impact.",
            "The key insight? Millennials hate food waste, yet they experience 'Fridge Blindness' – seeing only ingredients, not meals. This was Hellmann's chance to step in."
          ]
        },
        {
          "heading": "Strategic Solution",
          "content": [
            "We transformed Hellmann's into the essential ingredient that helps turn food waste into delicious meals. Our call to action: 'Make Taste, Not Waste.' To achieve maximum resonance, we brought this message to the Super Bowl, leveraging America's second largest food waste day as our powerful platform."
          ]
        },
        {
          "heading": "Campaign Execution",
          "content": [
            "Social Strategy & Rollout Plan",
            "Super Bowl Activation",
            "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/AcXPlxXGiJ0\" title=\"Hellmann's Super Bowl Ad\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>"
          ]
        }
      ],
      "sidebar": {
        "role": [
          "Strategy/ Leadership",
          "Social Strategy & Rollout Plan"
        ],
        "results": [
          { "label": "Super Bowl Activation", "value": "Yes" }
        ]
      }
    },
    "nextProject": {
      "slug": "hexclad-area-51",
      "client": "HexClad",
      "title": "Area 51 Super Bowl Campaign"
    }
  },
  {
    "slug": "hexclad-area-51",
    "title": "Area 51 Super Bowl Campaign",
    "client": "HexClad",
    "tag": "Super Bowl",
    "summary": "For HexClad's first-ever debut at the Super Bowl, we didn't just launch an ad—we engineered a viral phenomenon that established HexClad as advanced, out-of-this-world cooking technology.",
    "image": "/campaigns/hexclad.png",
    "header": {
      "bg": "gray-50",
      "darkBg": "gray-900"
    },
    "main": {
      "sections": [
        {
          "heading": "The Challenge",
          "content": [
            "HexClad faced the ultimate marketing challenge: making their Super Bowl debut count. With millions of viewers and enormous investment at stake, the brand needed to establish itself as more than just another cookware company.",
            "The goal was to position HexClad as advanced, innovative cooking technology that transcends traditional kitchen boundaries—literally out of this world."
          ]
        },
        {
          "heading": "The Viral Strategy",
          "content": [
            "We threw out the traditional playbook of releasing a trailer to build anticipation for our spot. Instead, we released the campaign by creating a conspiracy theory that Gordon Ramsay was cooking at Area 51, fueled by influencer storytelling and internet speculation.",
            "This mystery captivated 69 million people and generated 6 billion impressions before the big reveal. The campaign transcended traditional advertising, offering an immersive experience that kept audiences engaged and eagerly anticipating the final reveal.",
            "The mystery culminated in a Super Bowl ad revealing that Gordon was cooking for aliens using HexClad's advanced technology, perfectly positioning the brand as innovative and otherworldly."
          ]
        },
        {
          "heading": "Campaign Execution",
          "content": [
            "Created an elaborate conspiracy theory around Gordon Ramsay's mysterious activities at Area 51, building intrigue and speculation across social media platforms.",
            "Leveraged influencer storytelling to fuel internet speculation and organic conversation, creating authentic buzz around the mystery without revealing the brand connection.",
            "Timed the big reveal perfectly for maximum Super Bowl impact, connecting all the mystery elements to HexClad's advanced cooking technology in a memorable, shareable moment."
          ]
        }
      ],
      "sidebar": {
        "role": [
          "Campaign Strategy/Leadership",
          "Stunt Product Development and Roll Out Strategy",
          "Influencer & Paid Media Strategy",
          "Integrated Planning & Execution"
        ],
        "results": [
          { "label": "Increase in Media Efficiency Ratio", "value": "+28%" },
          { "label": "Organic Views on Teaser TikToks", "value": "50M+" },
          { "label": "Earned Impressions", "value": "15B" }
        ]
      }
    },
    "nextProject": {
      "slug": "supergoop-feel-super",
      "client": "Supergoop!",
      "title": "Feel Super Campaign"
    }
  },
  {
    "slug": "supergoop-feel-super",
    "title": "Feel Super Campaign",
    "client": "Supergoop!",
    "tag": "Social Campaign",
    "summary": "Revolutionized sunscreen culture with a social-first campaign featuring Liza Koshy as Chief Super Officer, blurring IRL and URL boundaries to build 'Super' equity and drive awareness for the crucial Summer buying season.",
    "image": "/campaigns/supergoop.png",
    "header": {
      "bg": "gray-50",
      "darkBg": "gray-900"
    },
    "main": {
      "sections": [
        {
          "heading": "The Challenge",
          "content": [
            "Supergoop! had successfully revolutionized sunscreen culture, but a crowded market demanded they reaffirm their superior quality. The objective was clear: build 'Super' equity and drive awareness going into the crucial Summer buying season.",
            "The brand needed to stand out in an increasingly competitive sunscreen market while maintaining their position as the premium, innovative choice for conscious consumers."
          ]
        },
        {
          "heading": "The Solution",
          "content": [
            "Our solution was a social-first campaign blurring the IRL and URL boundaries, spearheaded by our Chief Super Officer. We tapped Liza Koshy, whose authentic alignment with the brand ethos and undeniable internet presence uniquely positioned her to make audiences 'Feel Super.'",
            "The campaign leveraged Liza's natural charisma and social media expertise to create content that felt authentic while driving brand messaging home. By making her the Chief Super Officer, we created a narrative that extended beyond traditional advertising into lifestyle and aspiration."
          ]
        },
        {
          "heading": "Campaign Execution",
          "content": [
            "Strategic selection of Liza Koshy as Chief Super Officer, leveraging her authentic brand alignment and massive social media following to create credible, engaging content.",
            "Developed content that blurred the lines between online and offline experiences, creating shareable moments that drove organic engagement and brand awareness.",
            "Coordinated launch across multiple channels and touchpoints, ensuring consistent messaging while maximizing reach and impact during peak summer buying season.",
            "<div class=\"video-embed\"><video controls poster=\"/assets/Supergoop/Cover image.jpeg\" src=\"/assets/Supergoop/Performance Ads/ROSEWOOD_SuperGoop_Glowscreen_Cinemagraph_9x16_v3_source.mp4\"></video></div>",
            "<div class=\"video-embed\"><video controls poster=\"/assets/Supergoop/Cover image.jpeg\" src=\"/assets/Supergoop/Social Videos/Feel_Super_Hero_Spot_46_9x16_CAPTIONS.mp4\"></video></div>",
            "<div class=\"video-embed\"><video controls poster=\"/assets/Supergoop/Cover image.jpeg\" src=\"/assets/Supergoop/Super Product/GLASSES MOTION.mp4\"></video></div>"
          ]
        }
      ],
      "sidebar": {
        "role": [
          "Campaign Strategy/Leadership",
          "Stunt Product Development and Roll Out Strategy",
          "Influencer & Paid Media Strategy",
          "Integrated Planning, Coordination & Execution"
        ],
        "results": [
          { "label": "Lift in Unaided Brand Awareness", "value": "Double Digit" },
          { "label": "Earned Impressions", "value": "6.5B" },
          { "label": "Views", "value": "106M" }
        ]
      }
    },
    "nextProject": {
      "slug": "airbnb-weirdly-specific",
      "client": "Airbnb",
      "title": "Weirdly Specific TikTok Series"
    }
  }
] 